{"inkVersion":16,"root":[{"->":"I_i_Kay_to_Vanya"},"done",{"I_i_Kay_to_Vanya":[[["G>",["ev",{"VAR?":"visitcount"},1,"==","/ev",{"->":".^.b","c":true},{"b":[{"->":".^.^.^.^.^.TestResult"},{"->":".^.^.^.2"},null]}],"nop","G<",null],"\n","^Kay: Hey. ",{"#":"kay_neutral"},"\n","^Vanya: Hey you made it! ",{"#":"vanya_happy"},"\n",["ev","str","^Yelled at by parents","/str","/ev",{"*":".^.c","flg":20},{"c":["^Kay: Yeah, just had to deal with usual beratement from 'rents - ",{"#":"kay_angry"},"\n","^Kay: I forgot to do the dishes so I'm a terrible person or some shit like that.","\n","^Vanya: Sounds about right. ",{"#":"vanya_sarcastic"},"\n",{"->":".^.^.^.g-0"},{"#f":7}]}],["ev","str","^Took my time getting here","/str","/ev",{"*":".^.c","flg":20},{"c":["^Kay: Yeah, I just took my time getting here. ",{"#":"kay_neutral"},"\n","^Kay: I forget sometimes that this town is kinda pretty.","\n","^Vanya: Yeah bt we've seen it all a million times. Does that mean it's still pretty? ",{"#":"vanya_sarcastic"},"\n",{"->":".^.^.^.g-0"},{"#f":7}]}],["ev","str","^Didn't want to leave","/str","/ev",{"*":".^.c","flg":20},{"c":["^Kay: Yeah, not gonna lie I did not want to leave my room. ",{"#":"kay_neutral"},"\n","^Kay: I had a pretty perfect summer malaise going on; any longer and I was going to get eaten by the couch.","\n","^Vanya: I get that! I've been watching \"American Ninja Warrior\" non-stop, just 'cos there's nothing else on. ",{"#":"vanya_sarcastic"},"\n",{"->":".^.^.^.g-0"},{"#f":7}]}],{"g-0":["^Kay: Where's Halle at? ",{"#":"kay_neutral"},"\n","^Vanya: Over at the tower. Let's go see what's up. ",{"#":"vanya_neutral"},"\n","ev",{"VAR?":"visitcount"},1,"+",{"temp=":"visitcount","re":true},{"VAR?":"visitcount"},"/ev","done",{"#f":7}]}],{"TestResult":["^FUCK","\n","done",{"#f":3}],"#f":3}],"I_i_All":["^Kay: Yo. ",{"#":"kay_neutral"},"\n","^Halle: Hey K, what's up? ",{"#":"halle_neutral"},"\n","^Kay: Nothing much - What have you guys been up to? ",{"#":"kay_neutral"},"\n","^Halle: I watched \"The Avengers\" for the 18th time today - I'm convinced it's a film without flaws. ",{"#":"halle_happy"},"\n","^Vanya: Hell yeah. ",{"#":"vanya_happy"},"\n","^Kay: Amen. ",{"#":"kay_happy"},"\n","^Vanya: Oh yo so a guy came into the Gas N' Go today after filling up - bought a Snickers and a single lottery ticket, right? ",{"#":"vanya_neutral"},"\n","^Vanya: He won ten grand and I wanted to suplex him for it SO BAD. ",{"#":"vanya_angry"},"\n","^Halle: You're too loud to be a fugitive. ",{"#":"halle_sarcastic"},"\n","^Kay: What would you do with the cash? ",{"#":"kay_neutral"},"\n","^Kay: If you won $10,000 right now, bam, in your wallet, no questions asked.","\n","^... ",{"#":"none"},"\n","^Halle: Well first off, after taxes it's probably more like eight grand, so keep that in mind- ",{"#":"halle_neutral"},"\n","^Kay: UGH. Killjoy. ",{"#":"kay_angry"},"\n","^Vanya: Booooo. Don't bring taxes into this. I have to do them myself this year it sucks. ",{"#":"vanya_angry"},"\n","^Halle: So given EIGHT grand what would you do? ",{"#":"halle_sarcastic"},"\n","^Halle: I'd invest it - it's not much but it'd become something by the time I'm like, forty. ",{"#":"halle_neutral"},"\n","^Kay: I'd spend it instantly. ",{"#":"kay_neutral"},"\n","^Halle: I knew you'd say that- ",{"#":"kay_sarcastic"},"\n","^Kay: New phone, new clothes, laptop, bass guitar. All the essentials. ",{"#":"kay_happy"},"\n","^Vanya: I don't have a bank account, so I'd stuff it into my mattress and never tell my parents. ",{"#":"vanya_neutral"},"\n","^Halle: How the hell do you still not have a bank account? ",{"#":"halle_sarcastic"},"\n","^Vanya: Hey I don't wanna deal with that. I get paid in cash and it goes under my sleeping butt where it belongs. ",{"#":"vanya_neutral"},"\n","^... ",{"#":"none"},"\n","^Halle: Okay what about a MILLION dollars- ",{"#":"halle_neutral"},"\n","^Kay: Same thing. ",{"#":"kay_neutral"},"\n","^Vanya: Same thing. ",{"#":"kay_neutral"},"\n","^Kay: Your mattress would be very lumpy and I don't know how you'd hide that from your parents. ",{"#":"kay_sarcastic"},"\n","^Vanya: My mattress would be full of LIES. ",{"#":"vanya_sarcastic"},"\n","^Halle: You two have small dreams. ",{"#":"halle_sad"},"\n","^Kay: I dunno man, there isn't really space for big dreams nowadays. ",{"#":"kay_neutral"},"\n","^Vanya: I try not to think about that stuff. ",{"#":"vanya_neutral"},"\n","^Halle: Whatever. ",{"#":"halle_neutral"},"\n","^...","\n","^Kay: Let's get out of here. This shit's too picturesque. ",{"#":"kay_neutral"},"\n","done",{"#f":3}],"I_ii_All":[["^Kay: That's better.","\n","^Vanya: Good ol' Liberty Heights plaza.","\n","^Halle: This place is about as dead as it gets.","\n","^Kay: It sucks that the cinema closed.","\n","^Vanya: It sucks that the cinema got the emergency exits fixed so we couldn't sneak in during trailers.","\n","^Kay: Yeah. One less thing to do around here, and the list was getting pretty short already.","\n","^Halle: Speaking of shit to do, Vanya did you hear anything?","\n",["ev","str","^Yeah! Cam texted me.","/str","/ev",{"*":".^.c","flg":20},{"c":[{"->":".^.^.^.g-0"},{"#f":7}]}],["ev","str","^Yeah, Cody hit me up.","/str","/ev",{"*":".^.c","flg":20},{"c":[{"->":".^.^.^.g-0"},{"#f":7}]}],{"g-0":["^... ",{"#":"none"},"\n","^Kay: Yes? AND?","\n","^Vanya: Oh! Yeah he said there's a thing happening at Kelly Fleming's place.","\n","^Halle: Now we're talking.","\n","^Kay: I don't like your tone.","\n","^Halle: I'm bored and feel like doing something stupid,","\n","done",{"#f":7}]}],{"#f":3}],"II_i_main":["^Halle: Aight so Vanya you're off to choose your beau?","\n","^Vanya: I guess so? Ugh this is gonna suck no matter what huh.","\n","^Kay: It might? It might also go super well and you have two life-long friendships, both of whom you got to make out with at different times.","\n","^Kay: More likely yeah it gets awkward as fuck.","\n","^Halle: Sounds about right.","\n","^Kay: Are you planning some kind of mischief?","\n","^Halle: I'm in a mischief mood, yeah.","\n","^Kay: Oh goody.","\n","^Halle: Hey everyone says I should learn how to drink BEFORE I go to college, so why not?","\n","^Halle: What are you going to do?","\n","^Kay: I uhh am just going to hang out. I dunno.","\n","^Vanya: It'll be fun.","\n","^Kay: Yeah totally, that's the word people usually use to describe these things right?","\n","^Kay: Memories for a lifetime.","\n","done",{"#f":3}],"II_ii_Halle_to_Kelly":["^Kelly: Hey, Halle!","\n","^Kelly: I uhh, don't remember inviting you?","\n","^Halle: My RSVP must have been misplaced in the mail.","\n","^Kelly: I mean you're welcome to hang out, I just didn't think this was your scene.","\n","^Halle: It usually isn't, but I heard about it through the grape-vine and couldn't resist. Not a hell of a lot happening this summer.","\n","^Kelly: You doing anything cool?","\n","^Halle: No.","\n","^... ",{"#":"none"},"\n","^Kelly: Yeah. Umm, listen. Just- just don't start anything alright? I'm just trying to have a cool party.","\n",["ev","str","^Moi?","/str","/ev",{"*":".^.c","flg":20},{"c":[{"#f":7}]}],["ev","str","^No promises?","/str","/ev",{"*":".^.c","flg":20},{"c":[{"#f":7}]}],["ev","str","^Bad Choice","/str","/ev",{"*":".^.c","flg":20},{"c":["^Kelly: You know what I mean.","\n","done",{"#f":7}]}],{"#f":3}],"II_iv_main":[["^Matt: Have you been like, checked out for this?","\n","^Kay: Nope. Then they'd give me pills and I wouldn't feel shit and that freaks me out way more. ",{"#":"kay_sad"},"\n","^Matt: I kinda assumed you were too cool and detached to have emotions and shit.","\n",["ev","str","^Just a face to put on","/str","/ev",{"*":".^.c","flg":20},{"c":["^Kay: Yeah well, everyone getshanded a stereotype and I never fought mine. ",{"#":"kay_sad"},"\n","^Kay: If no one thinks they can get a rise out of you then they won't even try. ",{"#":"kay_neutral"},"\n",{"->":".^.^.^.g-0"},{"#f":7}]}],["ev","str","^Well that sucks","/str","/ev",{"*":".^.c","flg":20},{"c":["^Kay: Well that sucks, 'cos like we probably could've met and been friends BEFORE I was out here having a fucking freak out. ",{"#":"kay_sad"},"\n","^Kay: There are a bunch of people that would probably be rad to talk to, but they all think I don't give a shit.","\n","^Kay: I give a shit.","\n",{"->":".^.^.^.g-0"},{"#f":7}]}],["ev","str","^Don't I wish","/str","/ev",{"*":".^.c","flg":20},{"c":["^Kay: It'd be a shitload easier.","\n","^Matt: Amen to that.","\n",{"->":".^.^.^.g-0"},{"#f":7}]}],{"g-0":["^Kay: Fuck why am I dumping this all on you, I just met you like ten minutes ago. ",{"#":"kay_angry"},"\n","^Matt: We met at the Lakeview Drive block party when we were like, six or something.","\n","^Kay: I don't like that you remember that.","\n","^Kay: Did we have some quirky interaction you'll never forget?","\n","^Matt: No, no, our parents introduced us and you totally bailed.","\n","^Matt: More importantly Devin, Ryan, and I were busy stealing cookies and running into the woods to get away from it all. Even at that age we knew block parties weren't cool.","\n","^Matt: My point is we all know each other, even if we don't hang out. It's a small town.","\n","^Matt: There's nobody at this party I wouldn't hang out with.","\n","^Kay: Well shit I can think of at least-","\n",["ev","str","^Three.","/str","/ev",{"*":".^.c","flg":20},{"c":[{"->":".^.^.^.^.g-1"},{"#f":7}]}],["ev","str","^Twenty.","/str","/ev",{"*":".^.c","flg":20},{"c":[{"->":".^.^.^.^.g-1"},{"#f":7}]}],["ev","str","^76%.","/str","/ev",{"*":".^.c","flg":20},{"c":["^Kay: Real talk 76% of these people make me want to ramp into Quincy quarry. ",{"#":"kay_sarcastic"},"\n","^Matt: That's fucked up, rad as the image is.","\n",{"->":".^.^.^.^.g-1"},{"#f":7}]}],{"#f":7}],"g-1":["^Matt: Then why the heck are you here?","\n","^Kay: Vanya and Halle wanted to go, they're my friends so I did. It's a small town. ",{"#":"kay_neutral"},"\n","^Matt: Scrappy but loyal, girls who break shit. Can I join your gang?","\n","^Kay: Fuck off.","\n","^Kay: Also no.","\n","done",{"#f":7}]}],{"#f":3}],"global decl":["ev",0,{"VAR=":"visitcount"},"/ev","end",null],"#f":3}],"listDefs":{}}